import { Page, PageHeader } from "../../layouts/Page"
import { Section } from "../../layouts/Section"
import type { Block } from "../../components/content/types";
import RenderBlocks from "../../components/content/Blocks";
import Button from "../../components/Button";

import { TODO } from "../../components/Dev";

const whatIsFinancialPlanning: Block[] = [
  { type: "heading", level: "h3", content: "การวางแผนการเงินคืออะไร"},
  {
    type: "paragraph",
    content: [
      { type: "bold", content: "การวางแผนการเงิน" },
      { type: "text", content: " คือ กระบวนการในการจัดทำแผนการเงินส่วนบุคคลอย่างเหมาะสมเพื่อทำให้คุณสามารถบรรลุเป้าหมายชีวิตตามลำดับความสำคัญที่ต้องการได้ หรือเรียกง่าย ๆ ว่าคือ การวางแผนเกี่ยวกับการเงิน เพื่อให้ฝันเป็นจริงได้ครบถ้วนสมบูรณ์" }
    ]
  },
  {
    type: "paragraph",
    content: [
      { type: "text", content: "การวางแผนการเงิน ไม่ได้หมายถึงแผนสำหรับคนมีเงินเท่านั้น แต่คือแผนเพื่อให้คุณมีเงินเพียงพอใช้จ่าย และมีความสุขไปตลอดทุกช่วงวัยของชีวิต และไม่ได้หมายถึงการลงทุนเท่านั้น แต่ยังหมายรวมถึงการจัดทำงบประมาณรายรับรายจ่าย การบริหารจัดการความเสี่ยง การออมเงิน หรือการกำหนดกลยุทธ์สำหรับการลงทุนให้เหมาะสม การวางแผนทุนการศึกษาบุตร วางแผนการจะมีหนี้สินและบริหารจัดการหนี้สิน ไปจนถึงการวางแผนเพื่อเป้าหมายสำคัญต่างๆ ในชีวิต เช่น การซื้อบ้าน การสมรส ทุนการศึกษาบุตร การจัดการความเสี่ยงสำหรับตนเองและครอบครัวผ่านการทำประกัน การวางแผนภาษี รวมถึงการมีเงินทุนเพื่อเริ่มต้นทำธุรกิจ การวางแผนเกษียณอายุ และการวางแผนมรดกและจัดทำพินัยกรรมเพื่อส่งต่อความมั่งคั่งไปยังลูกหลาน เป็นต้น" }
    ]
  }
]

const financialPlanningBenefits: Block[] = [
  { type: "heading", level: "h3", content: "ประโยชน์ของการวางแผนการเงิน"},
  {
    type: "paragraph",
    content: [
      { type: "text", content: "การวางแผนการเงินช่วยให้คุณสามารถกำหนดแนวทางและเป้าหมายในการตัดสินใจต่างๆ เกี่ยวกับเรื่องการเงินได้ชัดเจนและครบถ้วน ภายใต้ข้อจำกัด เงื่อนไข หรือ ความเสี่ยงต่างๆ ของแต่ละบุคคล อีกทั้งช่วยให้คุณทราบถึงผลกระทบทั้งในระยะสั้นและระยะยาวที่อาจส่งผลต่อเป้าหมายชีวิต ดังนั้น คุณจึงสามารถปรับเปลี่ยนเป้าหมายชีวิตให้เข้ากับสถานการณ์ส่วนตัวที่เปลี่ยนแปลงไป และช่วยให้คุณมั่นใจได้ว่าจะสามารถบรรลุเป้าหมายชีวิตตามที่ต้องการได้" }
    ]
  },
]

const whoIsFinancialPlanner: Block[] = [
  { type: "heading", level: "h3", content: "นักวางแผนการเงินคือใคร"},
  {
    type: "paragraph",
    content: [
      { type: "bold", content: "นักวางแผนการเงิน" },
      { type: "text", content: " คือ บุคคลที่สามารถให้คำแนะนำแบบครอบคลุมองค์รวม โดยการวางแผนให้คุณว่าต้องทำสิ่งใด อย่างไร เมื่อไหร่ ใช้เครื่องมือทางการเงินใด เพื่อให้บรรลุเป้าหมายทางการเงินตามที่ต้องการ โดยการวิเคราะห์ภาพรวมสถานะทางการเงินของคุณ และให้คำแนะนำกลยุทธ์การวางแผนการเงินแบบองค์รวมที่เหมาะสมกับคุณ เช่น การจัดทำงบประมาณรายรับรายจ่าย การออมเงิน ภาษี การลงทุน การประกันชีวิต การเกษียณอายุ และการบริหารจัดการความเสี่ยงต่างๆ ในแต่ละช่วงอายุ" }
    ]
  },
  {
    type: "paragraph",
    content: [
      { type: "text", content: "ทั้งนี้นักวางแผนการเงินอาจให้บริการวางแผนการเงินเฉพาะด้านใดด้านหนึ่ง แต่จะให้คำแนะนำโดยพิจารณาจากสถานะทางการเงินในภาพรวมทั้งหมดของลูกค้า ทำให้นักวางแผนการเงินแตกต่างจากที่ปรึกษาทางการเงินทั่วไปที่อาจมีความเชี่ยวชาญเรื่องการเงินเฉพาะด้านใดด้านหนึ่งเท่านั้น" }
    ]
  },
  {
    type: "paragraph",
    content: [
      { type: "text", content: "สมาคมนักวางแผนการเงินไทยผลิตนักวางแผนการเงิน CFP® และที่ปรึกษาการเงิน AFPT™ ที่มีความรู้ ความสามารถ  และยึดมั่นในจรรยาบรรณอย่างเคร่งครัด ให้บริการวางแผนการเงินโดยคำนึงถึงประโยชน์ของลูกค้าเป็นสำคัญ มีคุณสมบัติตามเกณฑ์การรับรองคุณวุฒิวิชาชีพตามมาตรฐานสากล ได้แก่ ผ่านการอบรมและการสอบ มีประสบการณ์การทำงาน และปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน  รวมทั้งมีการพัฒนาความรู้อย่างต่อเนื่องเพื่อให้มีความรู้ที่ทันสมัยและทันต่อเหตุการณ์" }
    ]
  },

  { type: "heading", level: "h4", content: "นักวางแผนการเงิน CFP"},
  {
    type: "paragraph",
    content: [
      { type: "text", content: "นักวางแผนการเงิน CFP มีหน้าที่ให้คำแนะนำและวางแผนการเงินที่ครอบคลุมทุกด้าน ได้แก่ การวางแผนการบริหารกระแสเงินสด การวางแผนการลงทุน  การวางแผนประกันชีวิต การวางแผนเพื่อวัยเกษียณ และการวางแผนภาษีและมรดก รวมทั้งการวางแผนการเงินเพื่อเป้าหมายเฉพาะ" }
    ]
  },

  { type: "heading", level: "h4", content: "ที่ปรึกษาการเงิน AFPT"},
  {
    type: "paragraph",
    content: [
      { type: "text", content: "ที่ปรึกษาการเงิน AFPT มีหน้าที่ให้คำปรึกษาเฉพาะด้านการวางแผนการลงทุน และ/หรือด้านการวางแผนประกันชีวิตและการวางแผนเพื่อวัยเกษียณ" }
    ]
  },

  { type: "heading", level: "h4", content: "เครื่องหมายรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP"},
  {
    type: "paragraph",
    content: [
      { type: "text", content: "เครื่องหมายรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ได้แก่ CFP® CERTIFIED FINANCIAL PLANNER™ และ ที่ใช้ภายนอกประเทศสหรัฐอเมริกาเป็นลิขสิทธิ์ของ Financial Planning Standards Board Ltd. (FPSB) สมาคมนักวางแผนการเงินไทยเป็นหน่วยงานที่ได้รับอนุญาตให้บริหารจัดการโครงการรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ในประเทศไทยตามข้อตกลงกับ FPSB บุคคลที่มีคุณสมบัติตามเกณฑ์การรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ที่สมาคมฯ กำหนดเท่านั้น จะได้รับอนุญาตให้ใช้เครื่องหมายดังกล่าว" }
    ]
  },
]


const financialPlanningSixSteps: Block[] = [
  { type: "heading", level: "h3", content: "6 ขั้นตอนในการวางแผนการเงิน"},
  {
    type: "paragraph",
    content: [
      { type: "text", content: "กระบวนการวางแผนการเงินประกอบด้วย 6 ขั้นตอน ซึ่งกำหนดแผนการดำเนินการสำหรับนักวางแผนการเงินและลูกค้า ซึ่งจะช่วยให้คุณได้สำรวจตนเอง กำหนดเป้าหมาย และทราบถึงสิ่งที่คุณต้องทำเพื่อให้บรรลุเป้าหมายตามที่ต้องการ" }
    ]
  },
  {
    type: "list",
    ordered: true,
    items: [
      {content: [
        { type: "bold", content: "การสร้างความสัมพันธ์กับลูกค้าและกำหนดขอบเขตของข้อผูกพัน" }, { type: "break" },
        { type: "text", content: "นักวางแผนการเงินจะต้องอธิบายให้คุณทราบถึงขั้นตอนต่างๆ ที่เกี่ยวข้องกับการวางแผนการเงิน สอบถามเป้าหมายและความต้องการของคุณ รวมทั้งจัดลำดับเป้าหมายและความต้องการดังกล่าว และประเมินว่านักวางแผนการเงินจะสามารถช่วยให้คุณบรรลุเป้าหมายและความต้องการได้หรือไม่" }
      ]},
      {content: [
        { type: "bold", content: "การรวบรวมข้อมูลของลูกค้า" }, { type: "break" },
        { type: "text", content: "นักวางแผนการเงินจะสอบถามและต้องได้รับข้อมูลอย่างเพียงพอผ่านการสัมภาษณ์และขอเอกสารเกี่ยวกับสถานะทางการเงินของคุณ ได้แก่ รายรับ รายจ่าย  สินทรัพย์ และหนี้สิน และเป้าหมายและความต้องการทั้งในระยะสั้นและระยะยาวของคุณเพื่อใช้เป็นข้อมูลสำหรับการจัดทำแผนการเงิน" }
      ]},
      {content: [
        { type: "bold", content: "การวิเคราะห์และประเมินสถานะทางการเงินของลูกค้า" }, { type: "break" },
        { type: "text", content: "นักวางแผนการเงินจะต้องวิเคราะห์ข้อมูลสถานะทางการเงินในปัจจุบันของคุณ  ทั้งในด้านงบดุลส่วนบุคคล อัตราส่วนทางการเงิน (เงินออม/รายได้ ค่าใช้จ่าย/รายได้ หนี้/รายได้) งบกระแสเงินสด การทำประกันชีวิต พอร์ตการลงทุน และภาระภาษี เพื่อประเมินความสามารถในการบรรลุเป้าหมายและความต้องการ ตามลำดับความสำคัญ" }
      ]},
      {content: [
        { type: "bold", content: "การจัดทำและนำเสนอแผนการเงิน" }, { type: "break" },
        { type: "text", content: "นักวางแผนการเงินจะต้องจัดทำและนำเสนอแผนการเงิน โดยเสนอทางเลือกในการลงทุน ผลิตภัณฑ์ทางการเงิน และบริการที่เหมาะสมกับเป้าหมายและความต้องการของคุณ" }
      ]},
      {content: [
        { type: "bold", content: "การนำแผนการเงินไปปฏิบัติ" }, { type: "break" },
        { type: "text", content: "นักวางแผนการเงินจะต้องหารือแผนปฏิบัติการร่วมกับคุณเพื่อดำเนินการตามคำแนะนำในแผนการเงิน ซึ่งคุณอาจให้ความเห็นชอบหรือปฏิเสธคำแนะนำ รวมทั้งการปฏิบัติตามคำแนะนำดังกล่าว ทั้งนี้ นักวางแผนการเงินอาจใช้บริการของผู้ประกอบวิชาชีพอื่น เช่น นักบัญชี เป็นต้น" }
      ]},
      {content: [
        { type: "bold", content: "การทบทวนและปรับแผนการเงินตามสถานการณ์อย่างสม่ำเสมอ" }, { type: "break" },
        { type: "text", content: "เนื่องจากสมมติฐานทางการเงินและสถานการณ์ส่วนตัวของคุณอาจเปลี่ยนแปลงได้ตลอดเวลา ดังนั้น นักวางแผนการเงินจะต้องติดตามและทบทวนความเหมาะสมของคำแนะนำ และคุณจะต้องแจ้งให้นักวางแผนการเงินทราบการเปลี่ยนแปลงสมมติฐานทางการเงินและสถานการณ์ส่วนตัวที่มีนัยสำคัญโดยทันที เพื่อใช้ในการปรับแผนปฏิบัติการให้เหมาะสมและสอดคล้องกับสถานการณ์ที่เปลี่ยนแปลงไป" }
      ]},
    ]
  }
]

const financialPlannerInfoObligations: Block[] = [
  { type: "heading", level: "h3", content: "ข้อมูลที่นักวางแผนการเงินพึงเปิดเผยให้ลูกค้าทราบ"},
  {
    type: "list",
    ordered: true,
    items:
    [
      {
        content:
        [
          { type: "text", content: "หน้าที่และขอบเขตความรับผิดชอบของนักวางแผนการเงิน CFP และลูกค้าตามข้อตกลง", }
        ],
        children:
        {
          type: "list",
          items:
          [
            {
              content: [{ type: "bold", content: "บทบาทของนักวางแผนการเงิน CFP" }],
              children:
              {
                type: "list",
                items:
                [
                  { content: [{ type: "text", content: "วิเคราะห์สถานะทางการเงินของลูกค้า" }] },
                  { content: [{ type: "text", content: "จัดทำแผนการเงินที่ช่วยให้ลูกค้าบรรลุเป้าหมายและความต้องการตามลำดับความสำคัญ" }] },
                  { content: [{ type: "text", content: "ให้คำแนะนำที่สอดคล้องกับเป้าหมายและสถานะทางการเงินของลูกค้า" }] },
                ]
              }
            },
            {
              content: [{ type: "bold", content: "บทบาทของลูกค้า" }],
              children:
              {
                type: "list",
                items:
                [
                  { content: [{ type: "text", content: "ให้ข้อมูลเป้าหมายและความต้องการ​​​​​​​" }] },
                  { content: [{ type: "text", content: "เปิดเผยข้อมูลทางการเงินของตนเองและครอบครัว" }] },
                  { content: [{ type: "text", content: "ปฏิบัติตามคำแนะนำ" }] },
                  { content: [{ type: "text", content: "แจ้งการเปลี่ยนแปลงข้อมูลที่มีนัยสำคัญโดยทันที และเต็มใจที่จะดำเนินการตามแผนการเงินที่มีการแก้ไขให้สอดคล้องกับสถานการณ์ที่เปลี่ยนแปลงไป" }] },
                ]
              }
            },
          ]
        }
      },
      {
        content:
        [
          { type: "text", content: "ข้อมูลคุณสมบัติของนักวางแผนการเงิน CFP", }
        ],
        children:
        {
          type: "list",
          items:
          [
            { content: [{ type: "text", content: "คุณวุฒิวิชาชีพนักวางแผนการเงิน CFP บัตรประจำตัวนักวางแผนการเงิน CFP" }] },
            { content: [{ type: "text", content: "คุณวุฒิวิชาชีพอื่นและใบอนุญาตที่นักวางแผนการเงิน CFP หรือบริษัทนายจ้างได้รับ" }] },
            { content: [{ type: "text", content: "ประสบการณ์การทำงานและความเชี่ยวชาญ" }] },
          ],
        }
      },
      { content: [{ type: "text", content: "ข้อมูลติดต่อของนักวางแผนการเงิน CFP และบริษัทนายจ้าง", }] },
      { content: [{ type: "text", content: "รายละเอียดและรูปแบบค่าตอบแทน และผลประโยชน์ที่นักวางแผนการเงิน CFP ได้รับ", }] },
      { content: [{ type: "text", content: "หากนักวางแผนการเงิน CFP จำเป็นต้องนำข้อมูลของลูกค้าไปปรึกษากับผู้ประกอบวิชาชีพอื่น นักวางแผนการเงิน CFP จะต้องแจ้งให้ลูกค้าทราบ และต้องได้รับความยินยอมจากลูกค้าก่อน  ", }] },
      { content: [{ type: "text", content: "ข้อจำกัดของนักวางแผนการเงิน CFP ในการให้คำแนะนำ หรือขายผลิตภัณฑ์ทางการเงิน การลงทุน หรือประกันภัย ซึ่งอาจส่งผลต่อประโยชน์สูงสุดของลูกค้า", }] },
      { content: [{ type: "text", content: "รายละเอียดความขัดแย้งทางผลประโยชน์ที่อาจเกิดขึ้นระหว่างลูกค้ากับนักวางแผนการเงิน CFP บริษัทนายจ้าง หน่วยงานอื่น หรือบุคคลอื่น เช่น การมีส่วนได้เสียของนักวางแผนการเงิน CFP ในการแนะนำสินค้าและบริการทางการเงินของบริษัทซึ่งนักวางแผนการเงิน CFP เป็นพนักงานหรือผู้ถือหุ้น เป็นต้น", }] },
    ]
  }
]



export default function FinancialPlanning() {
  return (
    <Page>
      <PageHeader title="วางแผนการเงิน" />
      
      <Section title="รู้จักกับการวางแผนการเงิน">
        <RenderBlocks blocks={whatIsFinancialPlanning}/>
        <RenderBlocks blocks={financialPlanningBenefits}/>
        <div className="flex justify-center my-4">
          <Button to="/find_planner">ติดต่อขอรับบริการวางแผนการเงิน</Button>
        </div>
        <RenderBlocks blocks={whoIsFinancialPlanner}/>
        <RenderBlocks blocks={financialPlanningSixSteps}/>
        <RenderBlocks blocks={financialPlannerInfoObligations}/>
      </Section>

      <Section title="มุมความรู้การวางแผนการเงิน">
        <TODO />
      </Section>
    </Page>
  );
}
