import Header from "../../components/Header";
import Footer from "../../components/Footer";
import OrgChart from "../../components/OrgChart";

import { Section, SubSectionUnorderedList, SubSectionParagraph } from "../../layouts/sections";

import nsf_logo from "../../assets/logos/nsf.png"


function Mission() {
  return (
    <Section title="พันธกิจ">
      <SubSectionUnorderedList
        items={[
          "ส่งเสริมวิชาชีพนักวางแผนการเงิน CFP ให้เป็นที่รู้จักแพร่หลายในอุตสาหกรรมการเงินของไทย โดยผลิตนักวางแผนการเงิน CFP ที่มีคุณภาพ มีจรรยาบรรณในการประกอบวิชาชีพตามมาตรฐานสากล",
          "สร้างมาตรฐานการวางแผนการเงินที่เป็นเลิศ"
        ]}
      />
    </Section>
  );
}


function History() {
  return (
    <Section title="ประวัติสมาคม">
      <SubSectionParagraph
        items={[
          "สมาคมนักวางแผนการเงินไทย (Thai Financial Planners Association - TFPA) เป็นองค์กรกำกับดูแลตนเองที่ไม่แสวงหากำไร จัดตั้งขึ้นตามพระราชบัญญัติสมาคมการค้า พ.ศ. 2509 เมื่อวันที่ 26 กันยายน พ.ศ. 2550 ซึ่งมีผู้ร่วมก่อตั้งทั้งในส่วนของบุคคลและนิติบุคคล จำนวน 39 ราย ประกอบด้วย ธนาคารพาณิชย์ บริษัทประกันชีวิต บริษัทหลักทรัพย์ บริษัทหลักทรัพย์จัดการกองทุน กองทุนบำเหน็จบำนาญข้าราชการ และตลาดหลักทรัพย์แห่งประเทศไทย โดยเล็งเห็นประโยชน์ของบริการวางแผนการเงินที่จะมีต่อประชาชนและอุตสากรรมการเงินของประเทศไทยเป็นสำคัญ",
          "ในปี 2550 สมาคมฯ ได้เข้าร่วมเป็นสมาชิกของ Financial Planning Standards Board Ltd. (FPSB) นับเป็นสมาชิกลำดับที่ 22 จากสมาชิกรวม 26 ประเทศทั่วโลก โดยมุ่งส่งเสริมให้ผู้ที่ได้รับคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP และคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ซึ่งถือเป็นผู้ที่มีความรู้ ทักษะ ความสามารถ และมีจรรยาบรรณในการประกอบวิชาชีพได้รับการยอมรับและมีความน่าเชื่อถือในระดับสากล รวมทั้งเป็นที่รู้จักและยอมรับในอุตสาหกรรมการเงินของประเทศไทยอย่างกว้างขวาง",
          "ในปี 2552 มีผู้ขึ้นทะเบียนคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP กลุ่มแรก จำนวน 66 ราย และต่อมาในปี 2553 เริ่มมีผู้ขึ้นทะเบียนคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ด้านการลงทุน และคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ด้านประกันชีวิตและเพื่อการเกษียณ"
        ]}
      />
    </Section>
  );
}


{/*TODO: Likely not updated, would be good to have logos, maybe remove the logos gallery in Home*/}
function Founders() {
  return (
    <Section title="สมาชิกผู้ร่วมก่อตั้ง">
      <SubSectionUnorderedList
        items={[
          "เครือธนาคารกรุงเทพ จำกัด (มหาชน)",
          "เครือธนาคารทิสโก้ จำกัด (มหาชน)",
          "เครือธนาคารธนชาต จำกัด (มหาชน)",
          "เครือธนาคารหลวงไทย จำกัด (มหาชน)",
          "เครือธนาคารไทยพาณิชย์ จำกัด (มหาชน)",
          "เครือธนาคารกสิกรไทย จำกัด (มหาชน)",
          "ธนาคารยูโอบี จำกัด (มหาชน)",
          "ธนาคารเอชเอสบีซี ประเทศไทย",
          "ธนาคารเกียรตินาคิน จำกัด (มหาชน)",
          "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)",
          "ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย) จำกัด (มหาชน)",
          "บริษัทหลักทรัพย์ ดีบีเอส วิคเคอร์ส (ประเทศไทย) จำกัด",
          "บริษัทหลักทรัพย์ ภัทร จำกัด (มหาชน)",
          "บริษัทหลักทรัพย์ สินเอเซีย จำกัด",
          "บริษัทหลักทรัพย์จัดการกองทุน กรุงไทย จำกัด (มหาชน)",
          "บริษัทหลักทรัพย์จัดการกองทุน ทหารไทย จำกัด",
          "บริษัทหลักทรัพย์จัดการกองทุน ฟินันซ่า จำกัด",
          "บริษัทหลักทรัพย์จัดการกองทุนรวม วรรณ จำกัด",
          "บริษัทหลักทรัพย์จัดการกองทุน แอสเซท พลัส จำกัด",
          "บริษัทหลักทรัพย์จัดการกองทุน ไอเอ็นจี (ประเทศไทย) จำกัด",
          "บริษัท กรุงเทพประกันชีวิต จำกัด (มหาชน)",
          "บริษัท ไทยประกันชีวิต จำกัด (มหาชน)",
          "บริษัท ไทยสมุทรประกันชีวิต จำกัด (มหาชน)",
          "บริษัท เมืองไทยประกันชีวิต จำกัด (มหาชน)",
          "บริษัท อเมริกันอินเตอร์แนชชั่นแนล แอสชัวรันส์ จำกัด",
          "กองทุนบำเหน็จบำนาญข้าราชการ",
          "ตลาดหลักทรัพย์แห่งประเทศไทย",
        ]}
      />
    </Section>
  );
}


function OrganizationStructure() {
  return (
    <Section title="โครงสร้างสมาคม">
      <OrgChart />
    </Section>
  );
}


function Alliance() {
  return (
    <Section title="หน่วยงานพันธมิตร">
      <div className="flex flex-col items-center space-y-2">
        <a href="https://www.nsf.or.th">
          <img src={nsf_logo} alt="NSF Logo" className="h-40 mx-auto border border-gray-300" />
        </a>
        <p className="text-center">กองทุนการออมแห่งชาติ</p>
      </div>
    </Section>
  );
}

export default function Overview() {
  return (
    <div>
      <Header />
      <section className="p-4">
        <h1 className="text-xl mb-10 font-bold">เกี่ยวกับสมาคม</h1>
        <Mission />
        <History />
        <Founders />
        <OrganizationStructure />
        <Alliance />
      </section>
      <Footer />
    </div>
  );
}
