import { PageHeader } from "../../components/layout/global/PageHeader";
import { Page } from "../../components/layout/Page";
import { Section } from "../../components/layout/Section";
import { PDFLink } from "../../components/primitive/PDFLink";



export default function ForCompany() {
  const liClassName = "list-disc list-inside";
  const h4ClassName = "text-lg font-medium mt-6 mb-2";
  const ulClassName = "space-y-2";

  return (
    <Page>
      <PageHeader title="องค์กร" />
      <PDFLink
        href="https://tfpa.or.th/Upload/ใบสมัครสมาชิกนิติบุคคลสมาคมนักวางแผนการ.pdf"
        title="แบบฟอร์มสมัครสมาชิกนิติบุคคลสมาคมนักวางแผนการเงินไทย"
      />
      <PDFLink
        href="https://tfpa.or.th/Upload/2952019153246.pdf"
        title="แบบฟอร์มการจัดสอบหลักสูตรการวางแผนการเงิน CFP® ภายในองค์กรสำหรับสมาชิกนิติบุคคล"
      />

      <div className="mt-6">
        <Section title="สมาชิกนิติบุคคล ประเภทสถาบัน">
          <p>สมาชิกนิติบุคลประเภทสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>
          <h4 className={h4ClassName}>ค่าธรรมเนียม</h4>
          <ul className={ulClassName}>
            <li className={liClassName}>ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 50,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้</li>
            <li className={liClassName}>ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน</li>
          </ul>
          <h4 className={h4ClassName}>สิทธิประโยชน์</h4>
          <ul className={ulClassName}>
            <li className={liClassName}>เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ</li>
            <li className={liClassName}>เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก</li>
            <li className={liClassName}>มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 1 เสียง</li>
            <li className={liClassName}>ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ</li>
            <li className={liClassName}>พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)</li>
            <li className={liClassName}>พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม</li>
          </ul>
        </Section>
      </div>

      <div>
        <Section title="สมาชิกนิติบุคคล ประเภทเครือสถาบัน">
          <p>สมาชิกนิติบุคลประเภทสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>
          <h4 className={h4ClassName}>ค่าธรรมเนียม</h4>
          <ul className={ulClassName}>
            <li className={liClassName}>ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 120,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้</li>
            <li className={liClassName}>ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน</li>
          </ul>
          <h4 className={h4ClassName}>สิทธิประโยชน์</h4>
          <ul className={ulClassName}>
            <li className={liClassName}>เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ</li>
            <li className={liClassName}>เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก</li>
            <li className={liClassName}>มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 3 เสียง</li>
            <li className={liClassName}>ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ</li>
            <li className={liClassName}>พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)</li>
            <li className={liClassName}>พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม</li>
          </ul>
        </Section>
      </div>
    </Page>
  );
}
