import { PageHeader } from "../../components/layout/global/PageHeader";
import { Page } from "../../components/layout/Page";

export default function ForProfessional() {
  return (
    <Page>
      <PageHeader title="ผู้ประกอบวิชาชีพ CFP/AFPT" />

      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
      <p className="mt-8 mb-8">(เนื้อหาที่น่าสนใจเกี่ยวกับการต่ออายุ และพัฒนาคุณวุฒิวิชาชีพ)</p>
    </Page>
  );
}
