import Header from "../components/Header";
import Footer from "../components/Footer";

/*
info dump for now, likely will need to split and organize
*/

function Section({ title, children }: { title: string; children: React.ReactNode }) {
  return (
    <section>
      <h2 className="text-xl font-semibold border-b pb-2">{title}</h2>
      {children}
    </section>
  );
}


function SubSection({
  title,
  items,
}: {
  title: string;
  items: string[];
}) {
  return (
    <div>
      <h4 className="font-bold">{title}</h4>
      <ul className="list-disc pl-6 space-y-2 text-gray-700 mt-2">
        {items.map((item, i) => (
          <li key={i} className="leading-relaxed">
            {item}
          </li>
        ))}
      </ul>
    </div>
  );
}


function NaturalPerson() {
  return (
    <Section title="สมาชิกบุคคล">
      <h3>นักวางแผนการเงิน CFP</h3>
      <p>นักวางแผนการเงิน CFP มีสถานภาพเป็นสมาชิกสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย</p>
      <SubSection
        title="ค่าธรรมเนียม"
        items={[
          "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 7,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
          "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
        ]}
      />
      <SubSection
        title="สิทธิประโยชน์"
        items={[
          "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
          "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
          "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิกและมีสิทธิได้รับเลือกตั้งเป็นกรรมการ",
          "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ซึ่งแสดงถึงคุณวุฒิวิชาชีพนักวางแผนการเงินต่อท้ายชื่อ",
          "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
        ]}
      />
      <SubSection
        title="ภาระผูกพัน"
        items={[
          "ปฏิบัติตามข้อบังคับของสมาคมฯ",
          "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
          "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
          "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
        ]}
      />

      <h3>ที่ปรึกษาการเงิน AFPT</h3>
      <p>ที่ปรึกษาการเงิน AFPT มีสถานภาพเป็นสมาชิกวิสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย ค่าธรรมเนียม</p>
      <SubSection
        title="ค่าธรรมเนียม"
        items={[
          "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 2,400 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
          "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
        ]}
      />
      <SubSection
        title="สิทธิประโยชน์"
        items={[
          "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
          "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
          "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ซึ่งแสดงถึงคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ต่อท้ายชื่อ",
          "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
        ]}
      />
      {/* Wrong text? */}
      <SubSection
        title="ภาระผูกพัน"
        items={[
          "ปฏิบัติตามข้อบังคับของสมาคมฯ",
          "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
          "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
          "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
        ]}
      />
    </Section>
  );
}


// TODO: certainly move this to zone dedicated to legal entity
function LegalEntity() {
  return (
    <section>
      <h2 className="text-xl font-semibold border-b pb-2">สมาชิกนิติบุคคล</h2>
      <div>
        <h3 className="font-bold">สถาบัน</h3>
        <p>สมาชิกนิติบุคลประเภทสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>
        <br />
        <h4 className="font-bold">รายชื่อสมาชิก</h4>
        <ol className="list-disc pl-6 space-y-2 text-gray-700">
          <li>ตลาดหลักทรัพย์แห่งประเทศไทย</li>
          <li>ธนาคารกรุงไทย จำกัด (มหาชน)</li>
          <li>ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)</li>
          <li>ธนาคารเกียรตินาคินภัทร จำกัด (มหาชน)</li>
          <li>ธนาคารยูโอบี จำกัด (มหาชน)</li>
          <li>บริษัท กรุงเทพประกันชีวิต จำกัด (มหาชน)</li>
          <li>บริษัท ไทยประกันชีวิต จำกัด (มหาชน)</li>
          <li>บริษัท เมืองไทยประกันชีวิต จำกัด (มหาชน)</li>
          <li>บริษัท อลิอันซ์ อยุธยา ประกันชีวิต จำกัด (มหาชน)</li>
          <li>บริษัท เอไอเอ จำกัด</li>
          <li>บริษัทหลักทรัพย์ เกียรตินาคินภัทร จำกัด (มหาชน)</li>
          <li>บริษัทหลักทรัพย์ ฟิลลิป (ประเทศไทย) จำกัด (มหาชน)</li>
          <li>บริษัทหลักทรัพย์ หยวนต้า (ประเทศไทย) จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน กรุงไทย จำกัด (มหาชน)</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน กรุงศรี จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน ยูโอบี (ประเทศไทย) จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน อีสท์สปริง (ประเทศไทย) จำกัด</li>
          <li>บริษัทหลักทรัพย์นายหน้าซื้อขายหน่วยลงทุน ยูเนี่ยน เว็ลธ์ จำกัด</li>
        </ol>

        <h4 className="font-bold">ค่าธรรมเนียม</h4>
        <ul className="list-disc pl-6 space-y-2 text-gray-700">
          <li>ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 50,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้</li>
          <li>ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน</li>
        </ul>
        
        <h4 className="font-bold">สิทธิประโยชน์</h4>
        <ul className="list-disc pl-6 space-y-2 text-gray-700">
          <li>เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ</li>
          <li>เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก</li>
          <li>มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 1 เสียง</li>
          <li>ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ</li>
          <li>พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)</li>
          <li>พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม</li>
        </ul>
      </div>

      <br />

      <div>
        <h3 className="font-bold">เครือสถาบัน</h3>
        <p>สมาชิกนิติบุคลประเภทเครือสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>

        <h4 className="font-bold">รายชื่อสมาชิก</h4>
        <ol className="list-disc pl-6 space-y-2 text-gray-700">
          <li>ธนาคารกรุงเทพ จำกัด (มหาชน)</li>
          <li>ธนาคารกสิกรไทย จำกัด (มหาชน)</li>
          <li>ธนาคารทิสโก้ จำกัด (มหาชน)</li>
          <li>ธนาคารไทยพาณิชย์ จำกัด (มหาชน)</li>
          <li>บริษัท ทิสโก้ไฟแนนเชียลกรุ๊ป จำกัด (มหาชน)</li>
          <li>บริษัท แฟคเตอรี แอนด์ อีควิปเมนท์ กสิกรไทย จำกัด</li>
          <li>บริษัท ลีสซิ่ง กสิกรไทย จำกัด</li>
          <li>บริษัท ศูนย์วิจัยกสิกรไทย จำกัด</li>
          <li>บริษัทหลักทรัพย์ ทิสโก้ จำกัด</li>
          <li>บริษัทหลักทรัพย์ บัวหลวง จำกัด</li>
          <li>บริษัทหลักทรัพย์ อินโนเวสท์ เอกซ์ จำกัด</li>
          <li>บริษัทหลักทรัพย์กสิกรไทย จำกัด (มหาชน)</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน กสิกรไทย จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน ทิสโก้ จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน ไทยพาณิชย์ จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุน บางกอกแคปปิตอล จำกัด</li>
          <li>บริษัทหลักทรัพย์จัดการกองทุนรวม บัวหลวง จำกัด</li>
        </ol>

        <h4 className="font-bold">ค่าธรรมเนียม</h4>
        <ul className="list-disc pl-6 space-y-2 text-gray-700">
          <li>ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 120,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้</li>
          <li>ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน</li>
        </ul>
      
        <h4 className="font-bold">สิทธิประโยชน์</h4>
        <ul className="list-disc pl-6 space-y-2 text-gray-700">
          <li>เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ</li>
          <li>เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก</li>
          <li>มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 3 เสียง</li>
          <li>ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ</li>
          <li>พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)</li>
          <li>พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม</li>
        </ul>
      </div>
    </section>
  );
}


function Honorary() {
  return (
    <Section title="สมาชิกกิตติมศักดิ์">
      <ul className="list-disc pl-6 space-y-2 text-gray-700">
        <li className="leading-relaxed">นายกรณ์ จาติกวณิช</li>
        <li className="leading-relaxed">นายกิตติรัตน์ ณ ระนอง</li>
        <li className="leading-relaxed">ศ. (พิเศษ) กิติพงศ์ อุรพีพัฒนพงศ์</li>
        <li className="leading-relaxed">นายทรงเดช ประดิษฐสมานนท์</li>
        <li className="leading-relaxed">รศ. ธิติพันธุ์ เชื้อบุญชัย</li>
        <li className="leading-relaxed">นายพันธ์ศักดิ์ เวชอนุรักษ์</li>
        <li className="leading-relaxed">นางภัทรียา เบญจพลชัย</li>
        <li className="leading-relaxed">นายรพี สุจริตกุล</li>
      </ul>
    </Section>
  );
}


export default function Members() {
  return (
    <div>
      <Header />
      <NaturalPerson />
      <LegalEntity />
      <Honorary />
      <Footer />
    </div>
  );
}
