import type { Block } from "../components/primitive/renderer/types";

export const missionBlocks: Block[] = [
  {
    type: "list",
    items: [
      { content: [{ type: "text", content: "ส่งเสริมวิชาชีพนักวางแผนการเงิน CFP ให้เป็นที่รู้จักแพร่หลายในอุตสาหกรรมการเงินของไทย โดยผลิตนักวางแผนการเงิน CFP ที่มีคุณภาพ มีจรรยาบรรณในการประกอบวิชาชีพตามมาตรฐานสากล" }] },
      { content: [{ type: "text", content: "สร้างมาตรฐานการวางแผนการเงินที่เป็นเลิศ" }] }
    ]
  }
];

export const historyBlocks: Block[] = [
  { type: "paragraph", content: [{ type: "text", content: "สมาคมนักวางแผนการเงินไทย (Thai Financial Planners Association - TFPA) เป็นองค์กรกำกับดูแลตนเองที่ไม่แสวงหากำไร จัดตั้งขึ้นตามพระราชบัญญัติสมาคมการค้า พ.ศ. 2509 เมื่อวันที่ 26 กันยายน พ.ศ. 2550 ซึ่งมีผู้ร่วมก่อตั้งทั้งในส่วนของบุคคลและนิติบุคคล จำนวน 39 ราย ประกอบด้วย ธนาคารพาณิชย์ บริษัทประกันชีวิต บริษัทหลักทรัพย์ บริษัทหลักทรัพย์จัดการกองทุน กองทุนบำเหน็จบำนาญข้าราชการ และตลาดหลักทรัพย์แห่งประเทศไทย โดยเล็งเห็นประโยชน์ของบริการวางแผนการเงินที่จะมีต่อประชาชนและอุตสากรรมการเงินของประเทศไทยเป็นสำคัญ" }] },
  { type: "paragraph", content: [{ type: "text", content: "ในปี 2550 สมาคมฯ ได้เข้าร่วมเป็นสมาชิกของ Financial Planning Standards Board Ltd. (FPSB) นับเป็นสมาชิกลำดับที่ 22 จากสมาชิกรวม 26 ประเทศทั่วโลก โดยมุ่งส่งเสริมให้ผู้ที่ได้รับคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP และคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ซึ่งถือเป็นผู้ที่มีความรู้ ทักษะ ความสามารถ และมีจรรยาบรรณในการประกอบวิชาชีพได้รับการยอมรับและมีความน่าเชื่อถือในระดับสากล รวมทั้งเป็นที่รู้จักและยอมรับในอุตสาหกรรมการเงินของประเทศไทยอย่างกว้างขวาง" }] },
  { type: "paragraph", content: [{ type: "text", content: "ในปี 2552 มีผู้ขึ้นทะเบียนคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP กลุ่มแรก จำนวน 66 ราย และต่อมาในปี 2553 เริ่มมีผู้ขึ้นทะเบียนคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ด้านการลงทุน และคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ด้านประกันชีวิตและเพื่อการเกษียณ" }] }
];

export const founderBlocks: Block[] = [
  {
    type: "list",
    items: [
      { content: [{ type: "text", content: "เครือธนาคารกรุงเทพ จำกัด (มหาชน)" }] },
      { content: [{ type: "text", content: "เครือธนาคารทิสโก้ จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "เครือธนาคารธนชาต จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "เครือธนาคารหลวงไทย จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "เครือธนาคารไทยพาณิชย์ จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "เครือธนาคารกสิกรไทย จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "ธนาคารยูโอบี จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "ธนาคารเอชเอสบีซี ประเทศไทย"}] },
      { content: [{ type: "text", content: "ธนาคารเกียรตินาคิน จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย) จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์ ดีบีเอส วิคเคอร์ส (ประเทศไทย) จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์ ภัทร จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์ สินเอเซีย จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุน กรุงไทย จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุน ทหารไทย จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุน ฟินันซ่า จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุนรวม วรรณ จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุน แอสเซท พลัส จำกัด"}] },
      { content: [{ type: "text", content: "บริษัทหลักทรัพย์จัดการกองทุน ไอเอ็นจี (ประเทศไทย) จำกัด"}] },
      { content: [{ type: "text", content: "บริษัท กรุงเทพประกันชีวิต จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัท ไทยประกันชีวิต จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัท ไทยสมุทรประกันชีวิต จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัท เมืองไทยประกันชีวิต จำกัด (มหาชน)"}] },
      { content: [{ type: "text", content: "บริษัท อเมริกันอินเตอร์แนชชั่นแนล แอสชัวรันส์ จำกัด"}] },
      { content: [{ type: "text", content: "กองทุนบำเหน็จบำนาญข้าราชการ"}] },
      { content: [{ type: "text", content: "ตลาดหลักทรัพย์แห่งประเทศไทย"}] },
    ]
  }
];
