import Header from "../../components/Header";
import Footer from "../../components/Footer";

// import { Section, SubSection } from "../../layouts/Sections";

/*
info dump for now, likely will need to split and organize
*/



function NaturalPerson() {
  return (
    <Section title="สมาชิกบุคคล">
      <div>  
        <h3 className="font-bold">นักวางแผนการเงิน CFP</h3>
        <p>นักวางแผนการเงิน CFP มีสถานภาพเป็นสมาชิกสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย</p>
        <SubSection
          title="ค่าธรรมเนียม"
          items={[
            "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 7,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
            "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
          ]}
        />
        <SubSection
          title="สิทธิประโยชน์"
          items={[
            "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
            "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
            "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิกและมีสิทธิได้รับเลือกตั้งเป็นกรรมการ",
            "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ซึ่งแสดงถึงคุณวุฒิวิชาชีพนักวางแผนการเงินต่อท้ายชื่อ",
            "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
          ]}
        />
        <SubSection
          title="ภาระผูกพัน"
          items={[
            "ปฏิบัติตามข้อบังคับของสมาคมฯ",
            "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
            "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
            "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
          ]}
        />
      </div>
      <div>
        <h3 className="font-bold">ที่ปรึกษาการเงิน AFPT</h3>
        <p>ที่ปรึกษาการเงิน AFPT มีสถานภาพเป็นสมาชิกวิสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย ค่าธรรมเนียม</p>
        <SubSection
          title="ค่าธรรมเนียม"
          items={[
            "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 2,400 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
            "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
          ]}
          />
        <SubSection
          title="สิทธิประโยชน์"
          items={[
            "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
            "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
            "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ซึ่งแสดงถึงคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ต่อท้ายชื่อ",
            "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
          ]}
          />
        {/* Wrong text? */}
        <SubSection
          title="ภาระผูกพัน"
          items={[
            "ปฏิบัติตามข้อบังคับของสมาคมฯ",
            "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
            "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
            "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
          ]}
        />
      </div>
    </Section>
  );
}


// TODO: certainly move this to zone dedicated to legal entity
function LegalEntity() {
  return (
    <Section title="สมาชิกนิติบุคคล">
      <div>
        <h3 className="font-bold">สถาบัน</h3>
        <p>สมาชิกนิติบุคลประเภทสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>
        <br />
        <SubSection 
          title="รายชื่อสมาชิก"
          items={[
            "ตลาดหลักทรัพย์แห่งประเทศไทย",
            "ธนาคารกรุงไทย จำกัด (มหาชน)",
            "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)",
            "ธนาคารเกียรตินาคินภัทร จำกัด (มหาชน)",
            "ธนาคารยูโอบี จำกัด (มหาชน)",
            "บริษัท กรุงเทพประกันชีวิต จำกัด (มหาชน)",
            "บริษัท ไทยประกันชีวิต จำกัด (มหาชน)",
            "บริษัท เมืองไทยประกันชีวิต จำกัด (มหาชน)",
            "บริษัท อลิอันซ์ อยุธยา ประกันชีวิต จำกัด (มหาชน)",
            "บริษัท เอไอเอ จำกัด",
            "บริษัทหลักทรัพย์ เกียรตินาคินภัทร จำกัด (มหาชน)",
            "บริษัทหลักทรัพย์ ฟิลลิป (ประเทศไทย) จำกัด (มหาชน)",
            "บริษัทหลักทรัพย์ หยวนต้า (ประเทศไทย) จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน กรุงไทย จำกัด (มหาชน)",
            "บริษัทหลักทรัพย์จัดการกองทุน กรุงศรี จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน ยูโอบี (ประเทศไทย) จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน อีสท์สปริง (ประเทศไทย) จำกัด",
            "บริษัทหลักทรัพย์นายหน้าซื้อขายหน่วยลงทุน ยูเนี่ยน เว็ลธ์ จำกัด",
          ]}
        />
        <SubSection 
          title="ค่าธรรมเนียม"
          items={[
            "ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 50,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้",
            "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
          ]}
        />
        <SubSection 
          title="สิทธิประโยชน์"
          items={[
            "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
            "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
            "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 1 เสียง",
            "ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ",
            "พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)",
            "พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม",
          ]}
        />
      </div>
      <div>
        <h3 className="font-bold">เครือสถาบัน</h3>
        <p>สมาชิกนิติบุคลประเภทเครือสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>

        <SubSection 
          title="รายชื่อสมาชิก"
          items={[
            "ธนาคารกรุงเทพ จำกัด (มหาชน)",
            "ธนาคารกสิกรไทย จำกัด (มหาชน)",
            "ธนาคารทิสโก้ จำกัด (มหาชน)",
            "ธนาคารไทยพาณิชย์ จำกัด (มหาชน)",
            "บริษัท ทิสโก้ไฟแนนเชียลกรุ๊ป จำกัด (มหาชน)",
            "บริษัท แฟคเตอรี แอนด์ อีควิปเมนท์ กสิกรไทย จำกัด",
            "บริษัท ลีสซิ่ง กสิกรไทย จำกัด",
            "บริษัท ศูนย์วิจัยกสิกรไทย จำกัด",
            "บริษัทหลักทรัพย์ ทิสโก้ จำกัด",
            "บริษัทหลักทรัพย์ บัวหลวง จำกัด",
            "บริษัทหลักทรัพย์ อินโนเวสท์ เอกซ์ จำกัด",
            "บริษัทหลักทรัพย์กสิกรไทย จำกัด (มหาชน)",
            "บริษัทหลักทรัพย์จัดการกองทุน กสิกรไทย จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน ทิสโก้ จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน ไทยพาณิชย์ จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุน บางกอกแคปปิตอล จำกัด",
            "บริษัทหลักทรัพย์จัดการกองทุนรวม บัวหลวง จำกัด",
          ]}
        />
        <SubSection 
          title="ค่าธรรมเนียม"
          items={[
            "ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 120,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้",
            "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
          ]}
        />
        <SubSection 
          title="สิทธิประโยชน์"
          items={[
            "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
            "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
            "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 3 เสียง",
            "ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ",
            "พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)",
            "พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม",
          ]}
        />
      </div>
    </Section>
  );
}


function Honorary() {
  return (
    <Section title="สมาชิกกิตติมศักดิ์">
      <SubSection
        title=""
        items={[
          "นายกรณ์ จาติกวณิช",
          "นายกิตติรัตน์ ณ ระนอง",
          "ศ. (พิเศษ) กิติพงศ์ อุรพีพัฒนพงศ์",
          "นายทรงเดช ประดิษฐสมานนท์",
          "รศ. ธิติพันธุ์ เชื้อบุญชัย",
          "นายพันธ์ศักดิ์ เวชอนุรักษ์",
          "นางภัทรียา เบญจพลชัย",
          "นายรพี สุจริตกุล",
        ]}
      />
    </Section>
  );
}


export default function Members() {
  return (
    <div>
      <Header />
      <NaturalPerson />
      <LegalEntity />
      <Honorary />
      <Footer />
    </div>
  );
}
