import type { ListItems } from "./types";


export const roles_items: ListItems = [
  {
    title: "นักวางแผนการเงิน CFP",
    description: "นักวางแผนการเงิน CFP มีหน้าที่ให้คำแนะนำและวางแผนการเงินส่วนบุคคลที่ครอบคลุมครบทุกด้าน ได้แก่ การวางแผนการบริหารเงินสด การวางแผนการลงทุน การวางแผนการประกันชีวิต การวางแผนเพื่อวัยเกษียณ การวางแผนภาษีและมรดก และการวางแผนการเงินเพื่อเป้าหมายเฉพาะ"
  },
  {
    title: "ที่ปรึกษาการเงิน AFPT",
    description: "ที่ปรึกษาการเงิน AFPT มีหน้าที่ให้คำแนะนำและคำปรึกษาที่เกี่ยวข้องกับด้านการวางแผนการลงทุน และ/หรือด้านการวางแผนการประกันชีวิตและการวางแผนเพื่อวัยเกษียณ"
  }
];


export const requirements: {
    paragraph: string,
    items: ListItems
} = {
  paragraph: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีคุณสมบัติตามเกณฑ์การขึ้นทะเบียนงคุณวุฒิวิชาชีพที่สมาคมฯ กำหนด ดังนี้",
  items: [
    {
      title: "การศึกษา (Education)",
      description: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีความรู้ด้านการวางแผนการเงินและด้านอื่นๆ ที่เกี่ยวข้อง ทั้งในทางทฤษฎีและปฏิบัติตามมาตรฐานที่สมาคมฯ กำหนด โดยต้องเข้ารับการอบรมพื้นฐานความรู้ 6 วิชา กับสถาบันอบรมที่ได้รับอนุญาตของสมาคมฯ"
    },
    {
      title: "การสอบ (Examination)",
      description: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องผ่านการสอบหลักสูตรการวางแผนการเงิน CFP เพื่อประเมินความสามารถในการนำความรู้ และทักษะจากการอบรมไปประยุกต์ใช้สำหรับการวางแผนการเงิน"
    },
    {
      title: "ประสบการณ์การทำงาน (Experience)",
      description: "สมาคมฯ กำหนดให้นักวางแผนการเงิน CFP จะต้องมีประสบการณ์การทำงานที่เกี่ยวข้องโดยตรงกับการให้บริการวางแผนการเงินแก่ลูกค้า เพื่อแสดงให้เห็นว่าเป็นผู้มีความรู้ และความสามารถในเชิงปฏิบัติ"
    },
    {
      title: "จรรยาบรรณ (Ethics)",
      description: "นักวางแผนการเงิน CFP ที่ปรึกษาการเงิน AFPT และผู้สมัครขอขึ้นทะเบียนคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ที่ปรึกษาการเงิน AFPT (“ผู้สมัคร”) จะต้องปฏิบัติตามประมวลจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินเพื่อให้ลูกค้าได้รับประโยชน์สูงสุด รวมทั้งได้รับความเชื่อมั่นและความไว้วางใจจากลูกค้า"
    }
  ]
};


export const educationSection:
{
  intro: string,
  subjects: ListItems,
  resources: PDFLinks
} = {
  intro: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีความรู้เกี่ยวกับการวางแผนการเงินและด้านอื่นๆ ที่เกี่ยวข้อง ทั้งในทางทฤษฎีและปฏิบัติเป็นอย่างดีตามมาตรฐานที่สมาคมฯ กำหนด โดยจะต้องผ่านการอบรมหลักสูตรการวางแผนการเงิน ซึ่งประกอบด้วยพื้นฐานความรู้ 6 ชุดวิชา ดังนี้",

  subjects: [
    {
      title: "ชุดวิชาที่ 1",
      description: "พื้นฐานการวางแผนการเงิน ภาษี และจรรยาบรรณ (Foundation of Financial Planning, Taxation, and Ethics and Practice Standards)",
    },
    {
      title: "ชุดวิชาที่ 2",
      description: "การวางแผนการลงทุน (Investment Planning)",
    },
    {
      title: "ชุดวิชาที่ 3",
      description: "การวางแผนการประกันภัย (Insurance Planning)",
    },
    {
      title: "ชุดวิชาที่ 4",
      description: "การวางแผนเพื่อวัยเกษียณ (Retirement Planning)",
    },
    {
      title: "ชุดวิชาที่ 5",
      description: "การวางแผนภาษีและมรดก (Tax and Estate Planning)",
    },
    {
      title: "ชุดวิชาที่ 6",
      description: "การจัดทำแผนการเงิน (Financial Plan Construction)",
    }
  ],

  resources: [
    {
      text: "รายละเอียดของรายวิชาและวัตถุประสงค์การเรียนรู้หลักสูตรการวางแผนการเงิน CFP ชุดวิชาที่ 1 - 5",
      link: "https://www.tfpa.or.th/upload/97202118453.pdf",
    },
    {
      text: "วัตถุประสงค์การเรียนรู้ชุดวิชาที่ 2 การวางแผนการลงทุน ข้อสอบ 120 ข้อ (หลักสูตรปรับปรุงใหม่ ปี พ.ศ. 2564)",
      link: "https://www.tfpa.or.th/Upload/03_LOS_New%20M2.pdf",
    },
    {
      text: "วัตถุประสงค์การเรียนรู้ชุดวิชาที่ 6 การจัดทำแผนการเงินแบบองค์รวม (มีผลบังคับใช้ 1 มกราคม ปี พ.ศ. 2569)",
      link: "http://www.tfpa.or.th/upload/9c0f089f-5179-46f6-bcec-e5156ef11960.pdf",
    },  

    {
      text: "ดาวน์โหลดรายละเอียดจำนวนชั่วโมงความรู้ที่ได้รับอนุมัติ",
      link: "https://www.tfpa.or.th/upload/d9962470-d40a-43c5-9b57-6c1618a6e655.pdf"
    }
  ],

  paragraph2: [
    "การเข้ารับการอบรมในชุดวิชาที่ 6 จำเป็นต้องผ่านการอบรมในชุดวิชาที่ 1 - 5 ก่อน ผู้สนใจสามารถสอบถามรายละเอียดและลงทะเบียนเข้ารับการอบรมได้โดยตรงกับสถาบันอบรมของสมาคมฯ ทั้งนี้ สถาบันอบรมจะเป็นผู้กำหนดค่าธรรมเนียมการอบรมของแต่ละชุดวิชา"
  ],

  paragraph3: "หมายเหตุ: หลักสูตรอบรมนักวางแผนการเงิน CFP® สามารถใช้เป็นหลักสูตรอบรมความรู้สำหรับการต่ออายุการให้ความเห็นชอบเป็นผู้แนะนำการลงทุนและผู้วางแผนการลงทุน โดยมีรายละเอียดดังนี้"
};
