///////////////////////////////////////////////////////////////////////////////
// dump
///////////////////////////////////////////////////////////////////////////////

// export type InternetLink = {
//   label: string;
//   href: string;
// }

// type ListItem = {
//   title: string;
//   description: string;
// };
// export type ListItems = ListItem[];


///////////////////////////////////////////////////////////////////////////////
// เส้นทางอาชีพนักวางแผนการเงิน CFP®
///////////////////////////////////////////////////////////////////////////////

// export const roles_items: ListItems = [
//   {
//     title: "นักวางแผนการเงิน CFP",
//     description: "นักวางแผนการเงิน CFP มีหน้าที่ให้คำแนะนำและวางแผนการเงินส่วนบุคคลที่ครอบคลุมครบทุกด้าน ได้แก่ การวางแผนการบริหารเงินสด การวางแผนการลงทุน การวางแผนการประกันชีวิต การวางแผนเพื่อวัยเกษียณ การวางแผนภาษีและมรดก และการวางแผนการเงินเพื่อเป้าหมายเฉพาะ"
//   },
//   {
//     title: "ที่ปรึกษาการเงิน AFPT",
//     description: "ที่ปรึกษาการเงิน AFPT มีหน้าที่ให้คำแนะนำและคำปรึกษาที่เกี่ยวข้องกับด้านการวางแผนการลงทุน และ/หรือด้านการวางแผนการประกันชีวิตและการวางแผนเพื่อวัยเกษียณ"
//   }
// ];


// export const requirements: {
//     paragraph: string,
//     items: ListItems
// } = {
//   paragraph: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีคุณสมบัติตามเกณฑ์การขึ้นทะเบียนงคุณวุฒิวิชาชีพที่สมาคมฯ กำหนด ดังนี้",
//   items: [
//     {
//       title: "การศึกษา (Education)",
//       description: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีความรู้ด้านการวางแผนการเงินและด้านอื่นๆ ที่เกี่ยวข้อง ทั้งในทางทฤษฎีและปฏิบัติตามมาตรฐานที่สมาคมฯ กำหนด โดยต้องเข้ารับการอบรมพื้นฐานความรู้ 6 วิชา กับสถาบันอบรมที่ได้รับอนุญาตของสมาคมฯ"
//     },
//     {
//       title: "การสอบ (Examination)",
//       description: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องผ่านการสอบหลักสูตรการวางแผนการเงิน CFP เพื่อประเมินความสามารถในการนำความรู้ และทักษะจากการอบรมไปประยุกต์ใช้สำหรับการวางแผนการเงิน"
//     },
//     {
//       title: "ประสบการณ์การทำงาน (Experience)",
//       description: "สมาคมฯ กำหนดให้นักวางแผนการเงิน CFP จะต้องมีประสบการณ์การทำงานที่เกี่ยวข้องโดยตรงกับการให้บริการวางแผนการเงินแก่ลูกค้า เพื่อแสดงให้เห็นว่าเป็นผู้มีความรู้ และความสามารถในเชิงปฏิบัติ"
//     },
//     {
//       title: "จรรยาบรรณ (Ethics)",
//       description: "นักวางแผนการเงิน CFP ที่ปรึกษาการเงิน AFPT และผู้สมัครขอขึ้นทะเบียนคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ที่ปรึกษาการเงิน AFPT (“ผู้สมัคร”) จะต้องปฏิบัติตามประมวลจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินเพื่อให้ลูกค้าได้รับประโยชน์สูงสุด รวมทั้งได้รับความเชื่อมั่นและความไว้วางใจจากลูกค้า"
//     }
//   ]
// };


// export const educationSection:
// {
//   intro: string,
//   subjects: ListItems,
//   resources: PDFLinks
// } = {
//   intro: "นักวางแผนการเงิน CFP และที่ปรึกษาการเงิน AFPT จะต้องมีความรู้เกี่ยวกับการวางแผนการเงินและด้านอื่นๆ ที่เกี่ยวข้อง ทั้งในทางทฤษฎีและปฏิบัติเป็นอย่างดีตามมาตรฐานที่สมาคมฯ กำหนด โดยจะต้องผ่านการอบรมหลักสูตรการวางแผนการเงิน ซึ่งประกอบด้วยพื้นฐานความรู้ 6 ชุดวิชา ดังนี้",

//   subjects: [
//     {
//       title: "ชุดวิชาที่ 1",
//       description: "พื้นฐานการวางแผนการเงิน ภาษี และจรรยาบรรณ (Foundation of Financial Planning, Taxation, and Ethics and Practice Standards)",
//     },
//     {
//       title: "ชุดวิชาที่ 2",
//       description: "การวางแผนการลงทุน (Investment Planning)",
//     },
//     {
//       title: "ชุดวิชาที่ 3",
//       description: "การวางแผนการประกันภัย (Insurance Planning)",
//     },
//     {
//       title: "ชุดวิชาที่ 4",
//       description: "การวางแผนเพื่อวัยเกษียณ (Retirement Planning)",
//     },
//     {
//       title: "ชุดวิชาที่ 5",
//       description: "การวางแผนภาษีและมรดก (Tax and Estate Planning)",
//     },
//     {
//       title: "ชุดวิชาที่ 6",
//       description: "การจัดทำแผนการเงิน (Financial Plan Construction)",
//     }
//   ],

//   resources: [
//     {
//       text: "รายละเอียดของรายวิชาและวัตถุประสงค์การเรียนรู้หลักสูตรการวางแผนการเงิน CFP ชุดวิชาที่ 1 - 5",
//       link: "https://www.tfpa.or.th/upload/97202118453.pdf",
//     },
//     {
//       text: "วัตถุประสงค์การเรียนรู้ชุดวิชาที่ 2 การวางแผนการลงทุน ข้อสอบ 120 ข้อ (หลักสูตรปรับปรุงใหม่ ปี พ.ศ. 2564)",
//       link: "https://www.tfpa.or.th/Upload/03_LOS_New%20M2.pdf",
//     },
//     {
//       text: "วัตถุประสงค์การเรียนรู้ชุดวิชาที่ 6 การจัดทำแผนการเงินแบบองค์รวม (มีผลบังคับใช้ 1 มกราคม ปี พ.ศ. 2569)",
//       link: "http://www.tfpa.or.th/upload/9c0f089f-5179-46f6-bcec-e5156ef11960.pdf",
//     },  

//     {
//       text: "ดาวน์โหลดรายละเอียดจำนวนชั่วโมงความรู้ที่ได้รับอนุมัติ",
//       link: "https://www.tfpa.or.th/upload/d9962470-d40a-43c5-9b57-6c1618a6e655.pdf"
//     }
//   ],

//   paragraph2: [
//     "การเข้ารับการอบรมในชุดวิชาที่ 6 จำเป็นต้องผ่านการอบรมในชุดวิชาที่ 1 - 5 ก่อน ผู้สนใจสามารถสอบถามรายละเอียดและลงทะเบียนเข้ารับการอบรมได้โดยตรงกับสถาบันอบรมของสมาคมฯ ทั้งนี้ สถาบันอบรมจะเป็นผู้กำหนดค่าธรรมเนียมการอบรมของแต่ละชุดวิชา"
//   ],

//   paragraph3: "หมายเหตุ: หลักสูตรอบรมนักวางแผนการเงิน CFP® สามารถใช้เป็นหลักสูตรอบรมความรู้สำหรับการต่ออายุการให้ความเห็นชอบเป็นผู้แนะนำการลงทุนและผู้วางแผนการลงทุน โดยมีรายละเอียดดังนี้"
// };



///////////////////////////////////////////////////////////////////////////////
// ประเภท/สิทธิประโยชน์ของสมาชิก
///////////////////////////////////////////////////////////////////////////////

// function NaturalPerson() {
//   return (
//     <Section title="สมาชิกบุคคล">
//       <div>  
//         <h3 className="font-bold">นักวางแผนการเงิน CFP</h3>
//         <p>นักวางแผนการเงิน CFP มีสถานภาพเป็นสมาชิกสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย</p>
//         <SubSection
//           title="ค่าธรรมเนียม"
//           items={[
//             "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 7,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
//             "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
//           ]}
//         />
//         <SubSection
//           title="สิทธิประโยชน์"
//           items={[
//             "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
//             "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
//             "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิกและมีสิทธิได้รับเลือกตั้งเป็นกรรมการ",
//             "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ซึ่งแสดงถึงคุณวุฒิวิชาชีพนักวางแผนการเงินต่อท้ายชื่อ",
//             "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
//           ]}
//         />
//         <SubSection
//           title="ภาระผูกพัน"
//           items={[
//             "ปฏิบัติตามข้อบังคับของสมาคมฯ",
//             "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
//             "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
//             "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
//           ]}
//         />
//       </div>
//       <div>
//         <h3 className="font-bold">ที่ปรึกษาการเงิน AFPT</h3>
//         <p>ที่ปรึกษาการเงิน AFPT มีสถานภาพเป็นสมาชิกวิสามัญประเภทบุคคลธรรมดาของสมาคมนักวางแผนการเงินไทย ค่าธรรมเนียม</p>
//         <SubSection
//           title="ค่าธรรมเนียม"
//           items={[
//             "ชำระค่าธรรมเนียมการรับรองคุณวุฒิวิชาชีพและสมาชิกราย 2 ปี จำนวน 2,400 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนด",
//             "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3 พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
//           ]}
//           />
//         <SubSection
//           title="สิทธิประโยชน์"
//           items={[
//             "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
//             "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
//             "ใช้เครื่องหมายรับรองคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ซึ่งแสดงถึงคุณวุฒิวิชาชีพที่ปรึกษาการเงิน AFPT ต่อท้ายชื่อ",
//             "ได้รับส่วนลดร้อยละ 15 ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคมฯ",
//           ]}
//           />
//         {/* Wrong text? */}
//         <SubSection
//           title="ภาระผูกพัน"
//           items={[
//             "ปฏิบัติตามข้อบังคับของสมาคมฯ",
//             "ต่ออายุคุณวุฒิวิชาชีพนักวางแผนการเงิน CFP ทุก 2 ปี ปฏิทิน ภายในวันที่ 31 ธันวาคมของปีที่ครบกำหนดอายุ และจะต้องมีชั่วโมงของการพัฒนาคุณวุฒิวิชาชีพอย่างต่อเนื่อง (Continuing Professional Development: CPD) จำนวนไม่น้อยกว่า 30 ชั่วโมง ประกอบการต่ออายุคุณวุฒิวิชาชีพฯ โดยจะต้องมีจำนวนชั่วโมง CPD ที่มาจากกิจกรรม “การอบรมหรือสัมมนา” อย่างน้อย 15 ชั่วโมง และเป็นการอบรมหรือสัมมนาที่เกี่ยวข้องกับเรื่องจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงิน และ/หรือหลักปฏิบัติการวางแผนการเงินที่จัดโดยสมาคมฯ อย่างน้อยจำนวน 2 ชั่วโมง ทั้งนี้ สำหรับนักวางแผนการเงิน CFP ที่ขึ้นทะเบียนคุณวุฒิวิชาชีพครั้งแรก ให้เริ่มต้นนับระยะเวลาสำหรับการยื่นต่ออายุคุณวุฒิวิชาชีพ ตั้งแต่เดือนมกราคมของปีปฏิทินถัดไป",
//             "ปฏิบัติตามจรรยาบรรณและความรับผิดชอบในฐานะผู้ประกอบวิชาชีพวางแผนการเงินและหลักปฏิบัติของผู้ประกอบวิชาชีพวางแผนการเงินตามที่สมาคมฯ กำหนดอย่างเคร่งครัด",
//             "ปฏิบัติตามหลักปฏิบัติการวางแผนการเงินตามที่สมาคมฯ กำหนด",
//           ]}
//         />
//       </div>
//     </Section>
//   );
// }


// // TODO: certainly move this to zone dedicated to legal entity
// function LegalEntity() {
//   return (
//     <Section title="สมาชิกนิติบุคคล">
//       <div>
//         <h3 className="font-bold">สถาบัน</h3>
//         <p>สมาชิกนิติบุคลประเภทสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>
//         <br />
//         <SubSection 
//           title="รายชื่อสมาชิก"
//           items={[
//             "ตลาดหลักทรัพย์แห่งประเทศไทย",
//             "ธนาคารกรุงไทย จำกัด (มหาชน)",
//             "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)",
//             "ธนาคารเกียรตินาคินภัทร จำกัด (มหาชน)",
//             "ธนาคารยูโอบี จำกัด (มหาชน)",
//             "บริษัท กรุงเทพประกันชีวิต จำกัด (มหาชน)",
//             "บริษัท ไทยประกันชีวิต จำกัด (มหาชน)",
//             "บริษัท เมืองไทยประกันชีวิต จำกัด (มหาชน)",
//             "บริษัท อลิอันซ์ อยุธยา ประกันชีวิต จำกัด (มหาชน)",
//             "บริษัท เอไอเอ จำกัด",
//             "บริษัทหลักทรัพย์ เกียรตินาคินภัทร จำกัด (มหาชน)",
//             "บริษัทหลักทรัพย์ ฟิลลิป (ประเทศไทย) จำกัด (มหาชน)",
//             "บริษัทหลักทรัพย์ หยวนต้า (ประเทศไทย) จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน กรุงไทย จำกัด (มหาชน)",
//             "บริษัทหลักทรัพย์จัดการกองทุน กรุงศรี จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน ยูโอบี (ประเทศไทย) จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน อีสท์สปริง (ประเทศไทย) จำกัด",
//             "บริษัทหลักทรัพย์นายหน้าซื้อขายหน่วยลงทุน ยูเนี่ยน เว็ลธ์ จำกัด",
//           ]}
//         />
//         <SubSection 
//           title="ค่าธรรมเนียม"
//           items={[
//             "ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 50,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้",
//             "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
//           ]}
//         />
//         <SubSection 
//           title="สิทธิประโยชน์"
//           items={[
//             "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
//             "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
//             "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 1 เสียง",
//             "ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ",
//             "พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)",
//             "พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม",
//           ]}
//         />
//       </div>
//       <div>
//         <h3 className="font-bold">เครือสถาบัน</h3>
//         <p>สมาชิกนิติบุคลประเภทเครือสถาบันมีสถานภาพเป็นสมาชิกสามัญของสมาคมนักวางแผนการเงินไทย</p>

//         <SubSection 
//           title="รายชื่อสมาชิก"
//           items={[
//             "ธนาคารกรุงเทพ จำกัด (มหาชน)",
//             "ธนาคารกสิกรไทย จำกัด (มหาชน)",
//             "ธนาคารทิสโก้ จำกัด (มหาชน)",
//             "ธนาคารไทยพาณิชย์ จำกัด (มหาชน)",
//             "บริษัท ทิสโก้ไฟแนนเชียลกรุ๊ป จำกัด (มหาชน)",
//             "บริษัท แฟคเตอรี แอนด์ อีควิปเมนท์ กสิกรไทย จำกัด",
//             "บริษัท ลีสซิ่ง กสิกรไทย จำกัด",
//             "บริษัท ศูนย์วิจัยกสิกรไทย จำกัด",
//             "บริษัทหลักทรัพย์ ทิสโก้ จำกัด",
//             "บริษัทหลักทรัพย์ บัวหลวง จำกัด",
//             "บริษัทหลักทรัพย์ อินโนเวสท์ เอกซ์ จำกัด",
//             "บริษัทหลักทรัพย์กสิกรไทย จำกัด (มหาชน)",
//             "บริษัทหลักทรัพย์จัดการกองทุน กสิกรไทย จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน ทิสโก้ จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน ไทยพาณิชย์ จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุน บางกอกแคปปิตอล จำกัด",
//             "บริษัทหลักทรัพย์จัดการกองทุนรวม บัวหลวง จำกัด",
//           ]}
//         />
//         <SubSection 
//           title="ค่าธรรมเนียม"
//           items={[
//             "ชำระค่าธรรมเนียมสมาชิกรายปี จำนวน 120,000 บาท (ไม่รวมภาษีมูลค่าเพิ่ม) และไม่ต้องหักภาษี ณ ที่จ่าย เนื่องจากสมาคมฯ เข้าข่ายได้รับการยกเว้นภาษีเงินได้ในส่วนนี้",
//             "ชำระเงินโดยเช็คสั่งจ่าย “สมาคมนักวางแผนการเงินไทย” หรือโอนเข้าบัญชี “สมาคมนักวางแผนการเงินไทย” ธนาคารกสิกรไทย สาขาคลองเตย เลขที่ 017-2-27111-3  พร้อมกับส่งสำเนาใบโอนมายังสมาคมฯ เพื่อใช้เป็นหลักฐานการชำระเงิน",
//           ]}
//         />
//         <SubSection 
//           title="สิทธิประโยชน์"
//           items={[
//             "เสนอความคิดเห็นหรือให้คำแนะนำนโยบาย และการดำเนินงานของสมาคมฯ",
//             "เข้าร่วมประชุม แสดงความคิดเห็นซักถามและเสนอญัตติในการประชุมใหญ่สมาชิก",
//             "มีสิทธิในการออกเสียงลงคะแนนในที่ประชุมใหญ่สมาชิก จำนวน 3 เสียง",
//             "ผู้แทนของสมาชิกมีสิทธิได้รับการเสนอชื่อเพื่อคัดเลือกเป็นกรรมการสมาคมฯ",
//             "พนักงานของสมาชิกได้รับส่วนลดค่าธรรมเนียมการอบรมหลักสูตรการวางแผนการเงิน CFP จำนวน 300 บาท/คน/ชุดวิชา (ติดต่อสอบถามข้อมูลส่วนลดค่าธรรมเนียมการอบรมได้โดยตรงที่สถาบันอบรม)",
//             "พนักงานของสมาชิกได้รับส่วนลดร้อยละ 15  ในส่วนของหนังสือตำราของสมาคมฯ ค่าธรรมเนียมการสอบหลักสูตรนักวางแผนการเงิน CFP และค่าธรรมเนียมการเข้าร่วมสัมมนาที่จัดโดยสมาคม",
//           ]}
//         />
//       </div>
//     </Section>
//   );
// }


// function Honorary() {
//   return (
//     <Section title="สมาชิกกิตติมศักดิ์">
//       <SubSection
//         title=""
//         items={[
//           "นายกรณ์ จาติกวณิช",
//           "นายกิตติรัตน์ ณ ระนอง",
//           "ศ. (พิเศษ) กิติพงศ์ อุรพีพัฒนพงศ์",
//           "นายทรงเดช ประดิษฐสมานนท์",
//           "รศ. ธิติพันธุ์ เชื้อบุญชัย",
//           "นายพันธ์ศักดิ์ เวชอนุรักษ์",
//           "นางภัทรียา เบญจพลชัย",
//           "นายรพี สุจริตกุล",
//         ]}
//       />
//     </Section>
//   );
// }


// export default function Members() {
//   return (
//     <div>
//       <Header />
//       <NaturalPerson />
//       <LegalEntity />
//       <Honorary />
//       <Footer />
//     </div>
//   );
// }
